Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_telemetry_bm_bg96/Secure/firmware/src/packs/PIC32CM5164LS60100_DFP/pio/pic32cm5164ls60100.h
#define PIN_PA08F_PTC_DRV6                         _UINT32_(8) 
#define MUX_PA08F_PTC_DRV6                         _UINT32_(5) 
#define PINMUX_PA08F_PTC_DRV6                      ((PIN_PA08F_PTC_DRV6 << 16) | MUX_PA08F_PTC_DRV6)
#define PORT_PA08F_PTC_DRV6                        (_UINT32_(1) << 8)

#define PIN_PA09F_PTC_DRV7                         _UINT32_(9) 
#define MUX_PA09F_PTC_DRV7                         _UINT32_(5) 
#define PINMUX_PA09F_PTC_DRV7                      ((PIN_PA09F_PTC_DRV7 << 16) | MUX_PA09F_PTC_DRV7)
#define PORT_PA09F_PTC_DRV7                        (_UINT32_(1) << 9)

#define PIN_PA10F_PTC_DRV8                         _UINT32_(10)
#define MUX_PA10F_PTC_DRV8                         _UINT32_(5) 
#define PINMUX_PA10F_PTC_DRV8                      ((PIN_PA10F_PTC_DRV8 << 16) | MUX_PA10F_PTC_DRV8)
#define PORT_PA10F_PTC_DRV8                        (_UINT32_(1) << 10)

#define PIN_PA11F_PTC_DRV9                         _UINT32_(11)
#define MUX_PA11F_PTC_DRV9                         _UINT32_(5) 
#define PINMUX_PA11F_PTC_DRV9                      ((PIN_PA11F_PTC_DRV9 << 16) | MUX_PA11F_PTC_DRV9)
#define PORT_PA11F_PTC_DRV9                        (_UINT32_(1) << 11)

#define PIN_PA14F_PTC_DRV10                        _UINT32_(14)
#define MUX_PA14F_PTC_DRV10                        _UINT32_(5) 
#define PINMUX_PA14F_PTC_DRV10                     ((PIN_PA14F_PTC_DRV10 << 16) | MUX_PA14F_PTC_DRV10)
#define PORT_PA14F_PTC_DRV10                       (_UINT32_(1) << 14)

#define PIN_PA15F_PTC_DRV11                        _UINT32_(15)
#define MUX_PA15F_PTC_DRV11                        _UINT32_(5) 
#define PINMUX_PA15F_PTC_DRV11                     ((PIN_PA15F_PTC_DRV11 << 16) | MUX_PA15F_PTC_DRV11)
#define PORT_PA15F_PTC_DRV11                       (_UINT32_(1) << 15)

#define PIN_PA16F_PTC_DRV12                        _UINT32_(16)
#define MUX_PA16F_PTC_DRV12                        _UINT32_(5) 
#define PINMUX_PA16F_PTC_DRV12                     ((PIN_PA16F_PTC_DRV12 << 16) | MUX_PA16F_PTC_DRV12)
#define PORT_PA16F_PTC_DRV12                       (_UINT32_(1) << 16)

#define PIN_PA17F_PTC_DRV13                        _UINT32_(17)
#define MUX_PA17F_PTC_DRV13                        _UINT32_(5) 
#define PINMUX_PA17F_PTC_DRV13                     ((PIN_PA17F_PTC_DRV13 << 16) | MUX_PA17F_PTC_DRV13)
#define PORT_PA17F_PTC_DRV13                       (_UINT32_(1) << 17)

#define PIN_PA18F_PTC_DRV14                        _UINT32_(18)
#define MUX_PA18F_PTC_DRV14                        _UINT32_(5) 
#define PINMUX_PA18F_PTC_DRV14                     ((PIN_PA18F_PTC_DRV14 << 16) | MUX_PA18F_PTC_DRV14)
#define PORT_PA18F_PTC_DRV14                       (_UINT32_(1) << 18)

#define PIN_PA19F_PTC_DRV15                        _UINT32_(19)
#define MUX_PA19F_PTC_DRV15                        _UINT32_(5) 
#define PINMUX_PA19F_PTC_DRV15                     ((PIN_PA19F_PTC_DRV15 << 16) | MUX_PA19F_PTC_DRV15)
#define PORT_PA19F_PTC_DRV15                       (_UINT32_(1) << 19)

#define PIN_PA22F_PTC_DRV16                        _UINT32_(22)
#define MUX_PA22F_PTC_DRV16                        _UINT32_(5) 
#define PINMUX_PA22F_PTC_DRV16                     ((PIN_PA22F_PTC_DRV16 << 16) | MUX_PA22F_PTC_DRV16)
#define PORT_PA22F_PTC_DRV16                       (_UINT32_(1) << 22)

#define PIN_PA23F_PTC_DRV17                        _UINT32_(23)
#define MUX_PA23F_PTC_DRV17                        _UINT32_(5) 
#define PINMUX_PA23F_PTC_DRV17                     ((PIN_PA23F_PTC_DRV17 << 16) | MUX_PA23F_PTC_DRV17)
#define PORT_PA23F_PTC_DRV17                       (_UINT32_(1) << 23)

#define PIN_PA30F_PTC_DRV18                        _UINT32_(30)
#define MUX_PA30F_PTC_DRV18                        _UINT32_(5) 
#define PINMUX_PA30F_PTC_DRV18                     ((PIN_PA30F_PTC_DRV18 << 16) | MUX_PA30F_PTC_DRV18)
#define PORT_PA30F_PTC_DRV18                       (_UINT32_(1) << 30)

#define PIN_PA31F_PTC_DRV19                        _UINT32_(31)
#define MUX_PA31F_PTC_DRV19                        _UINT32_(5) 
#define PINMUX_PA31F_PTC_DRV19                     ((PIN_PA31F_PTC_DRV19 << 16) | MUX_PA31F_PTC_DRV19)
#define PORT_PA31F_PTC_DRV19                       (_UINT32_(1) << 31)

#define PIN_PB08F_PTC_DRV20                        _UINT32_(40)
#define MUX_PB08F_PTC_DRV20                        _UINT32_(5) 
#define PINMUX_PB08F_PTC_DRV20                     ((PIN_PB08F_PTC_DRV20 << 16) | MUX_PB08F_PTC_DRV20)
#define PORT_PB08F_PTC_DRV20                       (_UINT32_(1) << 8)

#define PIN_PB09F_PTC_DRV21                        _UINT32_(41)
#define MUX_PB09F_PTC_DRV21                        _UINT32_(5) 
#define PINMUX_PB09F_PTC_DRV21                     ((PIN_PB09F_PTC_DRV21 << 16) | MUX_PB09F_PTC_DRV21)
#define PORT_PB09F_PTC_DRV21                       (_UINT32_(1) << 9)

#define PIN_PA20F_PTC_DRV22                        _UINT32_(20)
#define MUX_PA20F_PTC_DRV22                        _UINT32_(5) 
#define PINMUX_PA20F_PTC_DRV22                     ((PIN_PA20F_PTC_DRV22 << 16) | MUX_PA20F_PTC_DRV22)
#define PORT_PA20F_PTC_DRV22                       (_UINT32_(1) << 20)

#define PIN_PA21F_PTC_DRV23                        _UINT32_(21)
#define MUX_PA21F_PTC_DRV23                        _UINT32_(5) 
#define PINMUX_PA21F_PTC_DRV23                     ((PIN_PA21F_PTC_DRV23 << 16) | MUX_PA21F_PTC_DRV23)
#define PORT_PA21F_PTC_DRV23                       (_UINT32_(1) << 21)

#define PIN_PA12F_PTC_DRV24                        _UINT32_(12)
#define MUX_PA12F_PTC_DRV24                        _UINT32_(5) 
#define PINMUX_PA12F_PTC_DRV24                     ((PIN_PA12F_PTC_DRV24 << 16) | MUX_PA12F_PTC_DRV24)
#define PORT_PA12F_PTC_DRV24                       (_UINT32_(1) << 12)

#define PIN_PA13F_PTC_DRV25                        _UINT32_(13)
#define MUX_PA13F_PTC_DRV25                        _UINT32_(5) 
#define PINMUX_PA13F_PTC_DRV25                     ((PIN_PA13F_PTC_DRV25 << 16) | MUX_PA13F_PTC_DRV25)
#define PORT_PA13F_PTC_DRV25                       (_UINT32_(1) << 13)

