Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_telemetry_bm_bg96/Secure/firmware/src/packs/PIC32CM5164LS60100_DFP/pio/pic32cm5164ls60100.h
#define PIN_PB04F_PTC_DRV26                        _UINT32_(36)
#define MUX_PB04F_PTC_DRV26                        _UINT32_(5) 
#define PINMUX_PB04F_PTC_DRV26                     ((PIN_PB04F_PTC_DRV26 << 16) | MUX_PB04F_PTC_DRV26)
#define PORT_PB04F_PTC_DRV26                       (_UINT32_(1) << 4)

#define PIN_PB05F_PTC_DRV27                        _UINT32_(37)
#define MUX_PB05F_PTC_DRV27                        _UINT32_(5) 
#define PINMUX_PB05F_PTC_DRV27                     ((PIN_PB05F_PTC_DRV27 << 16) | MUX_PB05F_PTC_DRV27)
#define PORT_PB05F_PTC_DRV27                       (_UINT32_(1) << 5)

#define PIN_PB06F_PTC_DRV28                        _UINT32_(38)
#define MUX_PB06F_PTC_DRV28                        _UINT32_(5) 
#define PINMUX_PB06F_PTC_DRV28                     ((PIN_PB06F_PTC_DRV28 << 16) | MUX_PB06F_PTC_DRV28)
#define PORT_PB06F_PTC_DRV28                       (_UINT32_(1) << 6)

#define PIN_PB07F_PTC_DRV29                        _UINT32_(39)
#define MUX_PB07F_PTC_DRV29                        _UINT32_(5) 
#define PINMUX_PB07F_PTC_DRV29                     ((PIN_PB07F_PTC_DRV29 << 16) | MUX_PB07F_PTC_DRV29)
#define PORT_PB07F_PTC_DRV29                       (_UINT32_(1) << 7)

#define PIN_PB12F_PTC_DRV30                        _UINT32_(44)
#define MUX_PB12F_PTC_DRV30                        _UINT32_(5) 
#define PINMUX_PB12F_PTC_DRV30                     ((PIN_PB12F_PTC_DRV30 << 16) | MUX_PB12F_PTC_DRV30)
#define PORT_PB12F_PTC_DRV30                       (_UINT32_(1) << 12)

#define PIN_PB13F_PTC_DRV31                        _UINT32_(45)
#define MUX_PB13F_PTC_DRV31                        _UINT32_(5) 
#define PINMUX_PB13F_PTC_DRV31                     ((PIN_PB13F_PTC_DRV31 << 16) | MUX_PB13F_PTC_DRV31)
#define PORT_PB13F_PTC_DRV31                       (_UINT32_(1) << 13)

#define PIN_PA03B_PTC_ECI0                         _UINT32_(3) 
#define MUX_PA03B_PTC_ECI0                         _UINT32_(1) 
#define PINMUX_PA03B_PTC_ECI0                      ((PIN_PA03B_PTC_ECI0 << 16) | MUX_PA03B_PTC_ECI0)
#define PORT_PA03B_PTC_ECI0                        (_UINT32_(1) << 3)

#define PIN_PA04B_PTC_ECI1                         _UINT32_(4) 
#define MUX_PA04B_PTC_ECI1                         _UINT32_(1) 
#define PINMUX_PA04B_PTC_ECI1                      ((PIN_PA04B_PTC_ECI1 << 16) | MUX_PA04B_PTC_ECI1)
#define PORT_PA04B_PTC_ECI1                        (_UINT32_(1) << 4)

#define PIN_PA05B_PTC_ECI2                         _UINT32_(5) 
#define MUX_PA05B_PTC_ECI2                         _UINT32_(1) 
#define PINMUX_PA05B_PTC_ECI2                      ((PIN_PA05B_PTC_ECI2 << 16) | MUX_PA05B_PTC_ECI2)
#define PORT_PA05B_PTC_ECI2                        (_UINT32_(1) << 5)

#define PIN_PA06B_PTC_ECI3                         _UINT32_(6) 
#define MUX_PA06B_PTC_ECI3                         _UINT32_(1) 
#define PINMUX_PA06B_PTC_ECI3                      ((PIN_PA06B_PTC_ECI3 << 16) | MUX_PA06B_PTC_ECI3)
#define PORT_PA06B_PTC_ECI3                        (_UINT32_(1) << 6)

#define PIN_PA00B_PTC_X0                           _UINT32_(0) 
#define MUX_PA00B_PTC_X0                           _UINT32_(1) 
#define PINMUX_PA00B_PTC_X0                        ((PIN_PA00B_PTC_X0 << 16) | MUX_PA00B_PTC_X0)
#define PORT_PA00B_PTC_X0                          (_UINT32_(1) << 0)

#define PIN_PA01B_PTC_X1                           _UINT32_(1) 
#define MUX_PA01B_PTC_X1                           _UINT32_(1) 
#define PINMUX_PA01B_PTC_X1                        ((PIN_PA01B_PTC_X1 << 16) | MUX_PA01B_PTC_X1)
#define PORT_PA01B_PTC_X1                          (_UINT32_(1) << 1)

#define PIN_PA02B_PTC_X2                           _UINT32_(2) 
#define MUX_PA02B_PTC_X2                           _UINT32_(1) 
#define PINMUX_PA02B_PTC_X2                        ((PIN_PA02B_PTC_X2 << 16) | MUX_PA02B_PTC_X2)
#define PORT_PA02B_PTC_X2                          (_UINT32_(1) << 2)

#define PIN_PA03B_PTC_X3                           _UINT32_(3) 
#define MUX_PA03B_PTC_X3                           _UINT32_(1) 
#define PINMUX_PA03B_PTC_X3                        ((PIN_PA03B_PTC_X3 << 16) | MUX_PA03B_PTC_X3)
#define PORT_PA03B_PTC_X3                          (_UINT32_(1) << 3)

#define PIN_PA05B_PTC_X4                           _UINT32_(5) 
#define MUX_PA05B_PTC_X4                           _UINT32_(1) 
#define PINMUX_PA05B_PTC_X4                        ((PIN_PA05B_PTC_X4 << 16) | MUX_PA05B_PTC_X4)
#define PORT_PA05B_PTC_X4                          (_UINT32_(1) << 5)

#define PIN_PA06B_PTC_X5                           _UINT32_(6) 
#define MUX_PA06B_PTC_X5                           _UINT32_(1) 
#define PINMUX_PA06B_PTC_X5                        ((PIN_PA06B_PTC_X5 << 16) | MUX_PA06B_PTC_X5)
#define PORT_PA06B_PTC_X5                          (_UINT32_(1) << 6)

#define PIN_PA08B_PTC_X6                           _UINT32_(8) 
#define MUX_PA08B_PTC_X6                           _UINT32_(1) 
#define PINMUX_PA08B_PTC_X6                        ((PIN_PA08B_PTC_X6 << 16) | MUX_PA08B_PTC_X6)
#define PORT_PA08B_PTC_X6                          (_UINT32_(1) << 8)

#define PIN_PA09B_PTC_X7                           _UINT32_(9) 
#define MUX_PA09B_PTC_X7                           _UINT32_(1) 
#define PINMUX_PA09B_PTC_X7                        ((PIN_PA09B_PTC_X7 << 16) | MUX_PA09B_PTC_X7)
#define PORT_PA09B_PTC_X7                          (_UINT32_(1) << 9)

#define PIN_PA10B_PTC_X8                           _UINT32_(10)
#define MUX_PA10B_PTC_X8                           _UINT32_(1) 
#define PINMUX_PA10B_PTC_X8                        ((PIN_PA10B_PTC_X8 << 16) | MUX_PA10B_PTC_X8)
#define PORT_PA10B_PTC_X8                          (_UINT32_(1) << 10)

#define PIN_PA11B_PTC_X9                           _UINT32_(11)
#define MUX_PA11B_PTC_X9                           _UINT32_(1) 
#define PINMUX_PA11B_PTC_X9                        ((PIN_PA11B_PTC_X9 << 16) | MUX_PA11B_PTC_X9)
#define PORT_PA11B_PTC_X9                          (_UINT32_(1) << 11)

#define PIN_PA14B_PTC_X10                          _UINT32_(14)
#define MUX_PA14B_PTC_X10                          _UINT32_(1) 
#define PINMUX_PA14B_PTC_X10                       ((PIN_PA14B_PTC_X10 << 16) | MUX_PA14B_PTC_X10)
#define PORT_PA14B_PTC_X10                         (_UINT32_(1) << 14)

#define PIN_PA15B_PTC_X11                          _UINT32_(15)
#define MUX_PA15B_PTC_X11                          _UINT32_(1) 
#define PINMUX_PA15B_PTC_X11                       ((PIN_PA15B_PTC_X11 << 16) | MUX_PA15B_PTC_X11)
#define PORT_PA15B_PTC_X11                         (_UINT32_(1) << 15)

#define PIN_PA16B_PTC_X12                          _UINT32_(16)
#define MUX_PA16B_PTC_X12                          _UINT32_(1) 
#define PINMUX_PA16B_PTC_X12                       ((PIN_PA16B_PTC_X12 << 16) | MUX_PA16B_PTC_X12)
#define PORT_PA16B_PTC_X12                         (_UINT32_(1) << 16)

#define PIN_PA17B_PTC_X13                          _UINT32_(17)
#define MUX_PA17B_PTC_X13                          _UINT32_(1) 
#define PINMUX_PA17B_PTC_X13                       ((PIN_PA17B_PTC_X13 << 16) | MUX_PA17B_PTC_X13)
#define PORT_PA17B_PTC_X13                         (_UINT32_(1) << 17)

#define PIN_PA18B_PTC_X14                          _UINT32_(18)
#define MUX_PA18B_PTC_X14                          _UINT32_(1) 
#define PINMUX_PA18B_PTC_X14                       ((PIN_PA18B_PTC_X14 << 16) | MUX_PA18B_PTC_X14)
#define PORT_PA18B_PTC_X14                         (_UINT32_(1) << 18)

#define PIN_PA19B_PTC_X15                          _UINT32_(19)
#define MUX_PA19B_PTC_X15                          _UINT32_(1) 
#define PINMUX_PA19B_PTC_X15                       ((PIN_PA19B_PTC_X15 << 16) | MUX_PA19B_PTC_X15)
#define PORT_PA19B_PTC_X15                         (_UINT32_(1) << 19)

#define PIN_PA22B_PTC_X16                          _UINT32_(22)
#define MUX_PA22B_PTC_X16                          _UINT32_(1) 
#define PINMUX_PA22B_PTC_X16                       ((PIN_PA22B_PTC_X16 << 16) | MUX_PA22B_PTC_X16)
#define PORT_PA22B_PTC_X16                         (_UINT32_(1) << 22)

#define PIN_PA23B_PTC_X17                          _UINT32_(23)
#define MUX_PA23B_PTC_X17                          _UINT32_(1) 
#define PINMUX_PA23B_PTC_X17                       ((PIN_PA23B_PTC_X17 << 16) | MUX_PA23B_PTC_X17)
#define PORT_PA23B_PTC_X17                         (_UINT32_(1) << 23)

#define PIN_PA30B_PTC_X18                          _UINT32_(30)
#define MUX_PA30B_PTC_X18                          _UINT32_(1) 
#define PINMUX_PA30B_PTC_X18                       ((PIN_PA30B_PTC_X18 << 16) | MUX_PA30B_PTC_X18)
#define PORT_PA30B_PTC_X18                         (_UINT32_(1) << 30)

#define PIN_PA31B_PTC_X19                          _UINT32_(31)
#define MUX_PA31B_PTC_X19                          _UINT32_(1) 
#define PINMUX_PA31B_PTC_X19                       ((PIN_PA31B_PTC_X19 << 16) | MUX_PA31B_PTC_X19)
#define PORT_PA31B_PTC_X19                         (_UINT32_(1) << 31)

